import this

# The Zen of Python, by Tim Peters

# Красиво лучше, чем уродливо.
# Явное лучше, чем неявное.
# Простое лучше, чем сложное.
# Сложное лучше, чем запутанное.
# Плоское лучше, чем вложенное.
# Разреженное лучше, чем плотное.
# Читабельность имеет значение.
# Особые случаи не настолько особенны, чтобы нарушать правила.
# Хотя практичность побеждает чистоту.
# Ошибки никогда не должны проходить молча.
# Если только они явно не замалчиваются.
# Перед лицом неоднозначности откажитесь от искушения угадать.
# Должен быть один — и желательно только один — очевидный способ сделать это.
# Хотя этот способ может быть неочевидным на первый взгляд, если вы не голландец.
# Сейчас лучше, чем никогда.
# Хотя никогда часто лучше, чем *прямо* сейчас.
# Если реализацию трудно объяснить, это плохая идея.
# Если реализацию легко объяснить, это может быть хорошей идеей.

# Пространства имен — это просто замечательная идея. Давайте сделаем их больше!