# Вы получили такую строку логов:
# 'May 24 12:48:31 ideapad systemd[1]: logrotate.service: Succeeded.'
# Совершите над ней следующие действия:

# 1.1. Выделите и выведите на экран дату и время.
# 1.2. Выделите и выведите на экран название сервиса (systemd[1]), записавшего лог.
# 1.3. Замените название ПК (ideapad) на PC-12092, выведите полученную строку на экран.
# 1.4. Найдите в логе слово failed и выведите его позицию, если такого слова нет, выведите -1.
# 1.5. Посчитайте количество букв 'S' в строке вне зависимости от регистра (и прописных, и заглавных).
# 1.6. Выделите из строки значения часов, минут и секунд, суммируйте эти 3 числа и выведите полученное число на экран.

# Вы получили такую строку логов:
# 'May 24 14:03:01 ideapad colord[844]: failed to get session [pid 8279]: Нет доступных данных'
# Нужно сформировать и вывести сообщение в таком формате:

# The PC "<имя ПК>" receive message from service "<имя сервиса>" what says "<сообщение>" becaus "<причина ошибки>" at <дата, время>